/*
 *      SC - spreadsheet calculator, version 3.1.
 *
 *      (c) Copyright DEMOS, 1989
 *      All rights reserved.
 *
 *      Authors: Serg I. Ryshkov, Serg V. Vakulenko
 *
 *      Mon Jul 31 17:17:13 MSK 1989
 */

# define VECTORFONT

# include <stdio.h>
# ifdef __MSDOS__
#    include <alloc.h>
# endif

extern FILE *OutHard;
int density;

# define PLOT_KIAE

/*
 * Параметры для печати графиков на Epson-80
 */

# define NXS    1050    /* Число точек по X */
# define NYS	1050	/* Число точек по Y */

# define DOTSIZE 2

# define FACTOR 1.
# define Pi 3.141592635

# define PINS 8		/* число используемых игл */

# define NFL	((NYS+DOTSIZE+PINS-2)/PINS)

# define SP(x,y) _Field[(y)/PINS][NXS-x-1] |=  ((1<<(PINS-1-(y%PINS)))&_Y_pic&(((_X_pic>>(x%16))&1)?0177777:0))
# define CP(x,y) _Field[(y)/PINS][NXS-x-1] &= ~((1<<(PINS-1-(y%PINS)))&_Y_pic&(((_X_pic>>(x%16))&1)?0177777:0))

# define SETPIX1(y,x) {if(_Color) SP((x),(y)); else CP((x),(y));}
/*
# define SETPIX(x,y)  {SETPIX1((x),(y));SETPIX1((x)+1,(y));SETPIX1((x),(y)-1);SETPIX1((x)+1,(y)-1) }
*/

static float obotx = 0.;
static float oboty = 0.;
# ifdef PLTHP
float botx = 0.;
float boty = 0.;
# else
static float botx = 0.;
static float boty = 0.;
# endif
static float scalex = 1.;
static float scaley = 1.;

static char * _Field [NFL+1];
static int _circflag;
static int _Color = 1;
static int _OX, _OY;
static int _lptr = 0;
static int _dotpat = 0177777;

static int _x_s, _y_s;          /* точка заливки */
static int _fx_s;               /* заливка до прямой */
static int _fp_s;               /* заливка до точки */
static int _X_pic = 0177777;
static int _Y_pic = 0177777;

# ifndef VECTORFONT
static char Font [] = {
0000,0000,0000,0000,0000,0000,0000,0000,0000,
0010,0010,0010,0010,0010,0010,0010,0000,0010,
0024,0024,0024,0000,0000,0000,0000,0000,0000,
0000,0101,0034,0042,0042,0042,0034,0101,0000,
0000,0024,0024,0177,0024,0177,0024,0024,0000,
0002,0105,0042,0020,0010,0004,0042,0121,0040,
0014,0022,0022,0014,0114,0062,0021,0061,0116,
0030,0020,0020,0010,0000,0000,0000,0000,0000,
0020,0010,0004,0004,0004,0004,0004,0010,0020,
0004,0010,0020,0020,0020,0020,0020,0010,0004,
0000,0010,0052,0034,0010,0034,0052,0010,0000,
0000,0000,0010,0010,0076,0010,0010,0000,0000,
0000,0000,0000,0000,0000,0000,0030,0020,0010,
0000,0000,0000,0000,0076,0000,0000,0000,0000,
0000,0000,0000,0000,0000,0000,0000,0030,0030,
0000,0100,0040,0020,0010,0004,0002,0001,0000,
0034,0042,0040,0121,0111,0105,0002,0042,0034,
0020,0030,0024,0020,0020,0020,0020,0020,0070,
0034,0042,0101,0100,0100,0060,0014,0002,0177,
0034,0042,0101,0100,0070,0100,0101,0042,0034,
0040,0060,0050,0044,0042,0041,0177,0040,0040,
0177,0001,0001,0037,0040,0100,0101,0042,0034,
0020,0010,0004,0002,0075,0101,0101,0042,0034,
0177,0100,0100,0040,0020,0010,0004,0002,0001,
0034,0042,0042,0034,0042,0101,0101,0042,0034,
0034,0042,0101,0101,0136,0040,0020,0010,0004,
0000,0030,0030,0000,0000,0000,0030,0030,0000,
0000,0030,0030,0000,0000,0000,0030,0020,0010,
0040,0020,0010,0004,0002,0004,0010,0020,0040,
0000,0000,0000,0076,0000,0076,0000,0000,0000,
0002,0004,0010,0020,0040,0020,0010,0004,0002,
0034,0042,0101,0100,0040,0020,0010,0000,0010,
0034,0042,0111,0125,0125,0125,0051,0002,0074,
0010,0024,0042,0101,0101,0177,0101,0101,0101,
0037,0041,0041,0021,0077,0101,0101,0101,0077,
0034,0042,0101,0001,0001,0001,0101,0042,0034,
0037,0041,0101,0101,0101,0101,0101,0041,0037,
0177,0001,0001,0001,0077,0001,0001,0001,0177,
0177,0001,0001,0001,0037,0001,0001,0001,0001,
0034,0042,0101,0001,0001,0161,0101,0102,0074,
0101,0101,0101,0101,0177,0101,0101,0101,0101,
0034,0010,0010,0010,0010,0010,0010,0010,0034,
0070,0020,0020,0020,0020,0020,0020,0022,0014,
0101,0041,0021,0011,0007,0011,0021,0041,0101,
0001,0001,0001,0001,0001,0001,0001,0001,0177,
0101,0143,0125,0111,0101,0101,0101,0101,0101,
0101,0101,0103,0105,0111,0121,0141,0101,0101,
0034,0042,0101,0101,0101,0101,0101,0042,0034,
0037,0041,0101,0101,0041,0037,0001,0001,0001,
0034,0042,0101,0101,0101,0101,0121,0042,0134,
0037,0041,0101,0101,0041,0037,0021,0041,0101,
0076,0101,0001,0001,0076,0100,0100,0101,0076,
0177,0010,0010,0010,0010,0010,0010,0010,0010,
0101,0101,0101,0101,0101,0101,0101,0042,0034,
0101,0101,0101,0101,0042,0042,0024,0024,0010,
0101,0101,0101,0101,0101,0111,0111,0125,0042,
0101,0101,0042,0024,0010,0024,0042,0101,0101,
0101,0101,0101,0042,0024,0010,0010,0010,0010,
0177,0100,0040,0020,0010,0004,0002,0001,0177,
0034,0004,0004,0004,0004,0004,0004,0004,0034,
0000,0001,0002,0004,0010,0020,0040,0100,0000,
0034,0020,0020,0020,0020,0020,0020,0020,0034,
0000,0000,0010,0024,0042,0000,0000,0000,0000,
0000,0000,0000,0000,0000,0000,0000,0000,0177,
0004,0010,0020,0000,0000,0000,0000,0000,0000,
0000,0000,0000,0074,0042,0042,0042,0042,0134,
0002,0002,0002,0002,0076,0102,0102,0102,0076,
0000,0000,0000,0074,0102,0002,0002,0102,0074,
0100,0100,0100,0100,0174,0102,0102,0102,0174,
0000,0000,0000,0074,0102,0102,0076,0002,0174,
0020,0050,0010,0034,0010,0010,0010,0010,0010,
0000,0000,0000,0074,0102,0102,0174,0100,0074,
0002,0002,0002,0002,0076,0102,0102,0102,0102,
0000,0010,0000,0010,0014,0010,0010,0010,0034,
0000,0020,0000,0020,0020,0020,0020,0024,0010,
0002,0002,0042,0022,0012,0016,0022,0042,0042,
0010,0014,0010,0010,0010,0010,0010,0010,0034,
0000,0000,0000,0045,0133,0111,0111,0111,0111,
0000,0000,0000,0072,0106,0102,0102,0102,0102,
0000,0000,0000,0074,0102,0102,0102,0102,0074,
0000,0000,0000,0076,0102,0102,0076,0002,0002,
0000,0000,0000,0174,0102,0102,0174,0100,0100,
0000,0000,0000,0072,0106,0002,0002,0002,0002,
0000,0000,0000,0074,0002,0074,0100,0102,0074,
0000,0000,0010,0034,0010,0010,0010,0010,0020,
0000,0000,0000,0042,0042,0042,0042,0042,0134,
0000,0000,0000,0101,0101,0101,0042,0024,0010,
0000,0000,0000,0101,0101,0101,0111,0125,0042,
0000,0000,0000,0102,0044,0030,0030,0044,0102,
0000,0000,0000,0042,0042,0024,0010,0010,0010,
0000,0000,0000,0176,0040,0020,0010,0004,0176,
0020,0010,0010,0010,0004,0010,0010,0010,0020,
0010,0010,0010,0010,0010,0010,0010,0010,0010,
0004,0010,0010,0010,0020,0010,0010,0010,0004,
0004,0052,0020,0000,0000,0000,0000,0000,0000,
0125,0052,0125,0052,0125,0052,0125,0052,0125,
0000,0000,0000,0062,0112,0116,0112,0112,0062,
0000,0000,0000,0034,0040,0074,0042,0042,0134,
0000,0040,0034,0002,0002,0076,0102,0102,0074,
0000,0000,0000,0042,0042,0042,0042,0134,0100,
0000,0000,0000,0070,0044,0044,0044,0176,0102,
0000,0000,0000,0176,0002,0076,0002,0002,0176,
0000,0000,0000,0076,0111,0111,0111,0076,0010,
0000,0000,0000,0176,0002,0002,0002,0002,0002,
0000,0000,0000,0102,0044,0030,0030,0044,0102,
0000,0000,0000,0102,0142,0122,0112,0106,0102,
0000,0000,0030,0102,0142,0122,0112,0106,0102,
0000,0000,0000,0042,0022,0016,0022,0042,0102,
0000,0000,0000,0160,0110,0110,0110,0104,0102,
0000,0000,0000,0101,0143,0125,0111,0101,0101,
0000,0000,0000,0102,0102,0176,0102,0102,0102,
0000,0000,0000,0074,0102,0102,0102,0102,0074,
0000,0000,0000,0176,0102,0102,0102,0102,0102,
0000,0000,0000,0174,0102,0102,0174,0104,0102,
0000,0000,0000,0076,0102,0102,0076,0002,0002,
0000,0000,0000,0174,0002,0002,0002,0002,0174,
0000,0000,0000,0076,0010,0010,0010,0010,0010,
0000,0000,0000,0102,0102,0102,0174,0100,0074,
0000,0000,0000,0111,0052,0034,0034,0052,0111,
0000,0000,0000,0076,0102,0076,0102,0102,0076,
0000,0000,0000,0002,0002,0076,0102,0102,0076,
0000,0000,0000,0102,0102,0116,0122,0122,0116,
0000,0000,0000,0074,0102,0060,0100,0102,0074,
0000,0000,0000,0111,0111,0111,0111,0111,0177,
0000,0000,0000,0076,0100,0160,0100,0100,0076,
0000,0000,0000,0111,0111,0111,0111,0177,0100,
0000,0000,0000,0102,0102,0102,0174,0100,0100,
0000,0000,0000,0006,0004,0074,0104,0104,0074,
0071,0105,0105,0105,0107,0105,0105,0105,0071,
0160,0110,0104,0102,0101,0177,0101,0101,0101,
0177,0001,0001,0001,0077,0101,0101,0101,0077,
0041,0041,0041,0041,0041,0041,0041,0177,0100,
0070,0044,0042,0042,0042,0042,0042,0177,0101,
0177,0001,0001,0001,0077,0001,0001,0001,0177,
0076,0111,0111,0111,0111,0076,0010,0010,0010,
0177,0001,0001,0001,0001,0001,0001,0001,0001,
0101,0101,0042,0024,0010,0024,0042,0101,0101,
0101,0101,0101,0141,0121,0111,0105,0103,0101,
0125,0111,0101,0141,0121,0111,0105,0103,0101,
0101,0041,0021,0011,0037,0041,0101,0101,0101,
0170,0104,0102,0102,0102,0102,0102,0102,0101,
0101,0143,0125,0111,0101,0101,0101,0101,0101,
0101,0101,0101,0101,0177,0101,0101,0101,0101,
0076,0101,0101,0101,0101,0101,0101,0101,0076,
0177,0101,0101,0101,0101,0101,0101,0101,0101,
0176,0101,0101,0101,0176,0110,0104,0102,0101,
0077,0101,0101,0101,0077,0001,0001,0001,0001,
0076,0101,0001,0001,0001,0001,0001,0101,0076,
0177,0010,0010,0010,0010,0010,0010,0010,0010,
0101,0101,0101,0101,0176,0100,0100,0100,0077,
0111,0111,0111,0052,0034,0052,0111,0111,0111,
0077,0101,0101,0101,0077,0101,0101,0101,0077,
0001,0001,0001,0001,0077,0101,0101,0101,0077,
0101,0101,0101,0101,0117,0121,0121,0121,0117,
0076,0101,0100,0100,0070,0100,0100,0101,0076,
0111,0111,0111,0111,0111,0111,0111,0111,0177,
0037,0040,0100,0100,0170,0100,0100,0040,0037,
0111,0111,0111,0111,0111,0111,0111,0177,0100,
0101,0101,0101,0101,0176,0100,0100,0100,0100,
0007,0004,0004,0004,0074,0104,0104,0104,0074,
};
# else /* VECTORFONT */

int     _SX, _SY;
/*
 * Описания к таблице символов
 * Символы закодированы перемещениями пера по
 * следующей матрице:
 *
 *  I S c m w   - размер прописной буквы
 *  H R b l v
 *  G Q a k u
 *  F.P.Z.j.t   - размер строчной буквы
 *  E O*Y*i s
 *  D N X h r
 *  C M W g q
 *  B.L.V.f.p.z - уровень строки
 *  A K U e o y
 *  @ J T d n x - место для подстрочных символов
 *
 * При этом разные линии (переход между которыми требует
 * поднятия пера) разделяются пробелами.
 * Таблица начинается с символа 040
 * После символа 0177 следует символ 0300
 *
 *      From (C) Руднев А.П. (KIAE)
 */
typedef char *tFONT[0140+0100];

# define X_PSIZE 6
# define Y_PSIZE 10
# define VF(c) ( (((c)&0340)==0 || ((c)&0340)==0200)? "":(c&0200)?VFONT[(c&0377)-0140]:VFONT[((c)&0377)-040] )
# define IndexC(c) ((c)>'Z'?(c)-'a'+('Z'-'@'+1):(c)-'@')
# define XP(i,sx) ((i/10)*(long)(sx)/X_PSIZE)
# define YP(i,sy) ((i%10-2)*(long)(sy)/Y_PSIZE)


tFONT VFONT= {
/* " " */ "",
/* "!" */ "VW cX",
/* """ */ "QS mk",
/* "#" */ "MQ kg rD Ft",
/* "$" */ "CgrsjPQRv cV",
/* "%" */ "Bw SIHRS pfgqp",
/* "&" */ "shgVLCabSHGp",
/* "'" */ "acma",

/* "(" */ "mbWf",
/* ")" */ "SbWL",
/* "*" */ "YGYaYuYsYqYWYCYEY",
/* "+" */ "Es aW",
/* "," */ "KgWV",
/* "-" */ "Es",
/* "." */ "LMWVL",
/* "/" */ "Bw",

/* "0" */ "CHSmvqfLC Bw",
/* "1" */ "QcVLf",
/* "2" */ "HSmvtBp",
/* "3" */ "IwZjsqfLC",
/* "4" */ "fmDr",
/* "5" */ "CLfqsjFIw",
/* "6" */ "FjsqfLCHSmv",
/* "7" */ "IwB",

/* "8" */ "PGHSmvujPECLfqsj",
/* "9" */ "LfqvmSHFOs",
/* ":" */ "ZakjZ VWgfV",
/* ";" */ "ZakZ KgWV",
/* "<" */ "kOg",
/* "=" */ "Dr Ft",
/* ">" */ "QiM",
/* "?" */ "RcmvuYX WV",

/* "@" */ "hjZONWgrtkQFCLf",
/* "A" */ "BGSmup Es",
/* "B" */ "FjuvmIBfqsj",
/* "C" */ "wSHCLp",
/* "D" */ "BfqvmIB",
/* "E" */ "wIBp jF",
/* "F" */ "BIw iE",
/* "G" */ "wSHCLprh",

/* "H" */ "BI Ft wp",
/* "I" */ "LfVcSm",
/* "J" */ "CLWcSm",
/* "K" */ "BI wFp",
/* "L" */ "IBp",
/* "M" */ "BIZwp",
/* "N" */ "BIpw",
/* "O" */ "CHSmvqfLC",

/* "P" */ "BImvtiE",
/* "Q" */ "CHSmvqfLC Xp",
/* "R" */ "BImclkZFZp",
/* "S" */ "BfqsjPGHSw",
/* "T" */ "Iw cV",
/* "U" */ "ICLfqw",
/* "V" */ "IVw",
/* "W" */ "ILYfw",

/* "X" */ "Bw Ip",
/* "Y" */ "IZw ZV",
/* "Z" */ "IwBp Oi",
/* "[" */ "mcVf",
/* "\" */ "Ip",
/* "]" */ "LVcS",
/* "^" */ "Eas",
/* "_" */ "Bz",

/* "`" */ "SkcS",
/* "a" */ "PjspLCDOs",
/* "b" */ "IBfqsjF",
/* "c" */ "tPECLp",
/* "d" */ "tPECLpw",
/* "e" */ "DrsjPECLp",
/* "f" */ "mbV Oi",
/* "g" */ "pLCEPtodJ",

/* "h" */ "BIFjsp",
/* "i" */ "ba ZWf",
/* "j" */ "AKVZ ab",
/* "k" */ "BIDtDp",
/* "l" */ "SbV",
/* "m" */ "BEPYVYjsp",
/* "n" */ "BFEPjsp",
/* "o" */ "CEPjsqfLC",

/* "p" */ "@FjsqfLC",
/* "q" */ "qfLCEPtn",
/* "r" */ "BFEPt",
/* "s" */ "BfqhNEPt",
/* "t" */ "cWf Pj",
/* "u" */ "FCLfqtp",
/* "v" */ "FVt",
/* "w" */ "FLXft",

/* "x" */ "FXBtXp",
/* "y" */ "FCLfqtodJ",
/* "z" */ "FtBp",
/* "{" */ "maYOYXf",
/* "|" */ "cV",
/* "}" */ "SaYiYXL",
/* "~" */ "EPhs",
/* DEL */ "BIwpBqDsFuHw",

/* "ю" */ "BFDXYjsqfWX",
/* "а" */ "qfLEPjstqz",
/* "б" */ "mSHjsqfLCEPj",
/* "ц" */ "FCLfqzyzqt",
/* "д" */ "cuqfLCEPjs",
/* "е" */ "DrsjPECLfq",
/* "ф" */ "UZXODCLWfqriX",
/* "г" */ "EPZiCLfq",

/* "х" */ "Bt Fp",
/* "и" */ "FBtp",
/* "й" */ "FBtp aZ",
/* "к" */ "BFDXtXp",
/* "л" */ "Btp",
/* "м" */ "BFXtp",
/* "н" */ "FBDrtp",
/* "о" */ "LDPjrfL",

/* "п" */ "BFtp",
/* "я" */ "BXrtZOXrp",
/* "р" */ "AFjsrgC",
/* "с" */ "sjPECLfq",
/* "т" */ "Ft ZV",
/* "у" */ "FDMgrtpeK",
/* "ж" */ "BNFNXZVXhthp",
/* "в" */ "DabSIBfqsjZD",

/* "ь" */ "FBVghYE",
/* "ы" */ "FBVghYE tp",
/* "з" */ "EPjshXqfLC",
/* "ш" */ "FBpt YV",
/* "э" */ "EPjsqfLC Xr",
/* "щ" */ "FBptpyx YV",
/* "ч" */ "FDMqtp",
/* "'" */ "FPLfqriO",

/* "Ю" */ "IB EORcmvqfVMO",
/* "А" */ "BDcwp Dr",
/* "Б" */ "wIBfqsjF",
/* "Ц" */ "IBpw pyx",
/* "Д" */ "ABzy LQcwp",
/* "Е" */ "mIBp Fj",
/* "Ф" */ "MgrulRGDM cV",
/* "Г" */ "BIw",

/* "Х" */ "BW IP",
/* "И" */ "IBwp",
/* "й" */ "IBwp Sbm",
/* "К" */ "IB FZp wZ",
/* "Л" */ "BDcwp",
/* "М" */ "BIYwp",
/* "Н" */ "IB Ft wp",
/* "О" */ "LDGSmurfL",

/* "П" */ "BIwp",
/* "Я" */ "BY sOFHSwp",
/* "Р" */ "BIcvtYE",
/* "С" */ "qfLCHSmv",
/* "Т" */ "HIwv cV",
/* "У" */ "IGPju wqfLC",
/* "Ж" */ "Bw cV pI",
/* "В" */ "FZklcIBfqsZ",

/* "Ь" */ "IBfqsjF",
/* "Ы" */ "IBVgiZF wp",
/* "З" */ "HSmvujsqfLC Zj",
/* "Ш" */ "IBpw bV",
/* "Э" */ "ImvqfB Os",
/* "Щ" */ "IBpw bV pyx",
/* "Ч" */ "IFOs wp",
/* "'" */ "HISLfqsjP"
};

# endif /* VECTORFONT */

# ifdef __MSDOS__
static local1 [48] = {
        0341, 0342, 0367, 0347, 0344, 0345, 0366, 0372,	/* абвгдежз */
	0351, 0352, 0353, 0354, 0355, 0356, 0357, 0360, /* ийклмноп */
	0362, 0363, 0364, 0365, 0346, 0350, 0343, 0376, /* рстуфхцч */
	0373, 0375, 0277, 0371, 0370, 0374, 0340, 0361, /* шщъыьэюя */
        0301, 0302, 0327, 0307, 0304, 0305, 0326, 0332,	/* абвгдежз */
	0311, 0312, 0313, 0314, 0315, 0316, 0317, 0320, /* ийклмноп */
};

static local2 [16] = {
	0322, 0323, 0324, 0325, 0306, 0310, 0303, 0336, /* рстуфхцч */
	0333, 0335, 0337, 0331, 0330, 0334, 0300, 0321, /* шщъыьэюя */
};
# endif

# ifndef SETPIX
SETPIX( x, y )
{
/*
	if( x <= 1 || x >= NXS-2 || y <= 1 || y >= NYS - 2 )
		fprintf( stderr, "x=%d   y=%d\n", x, y );
*/
	SETPIX1( x, y );
	SETPIX1( x+1, y );
	SETPIX1( x, y-1 );
	SETPIX1( x+1, y-1 );
}
# endif

/*
 * Рисование точки с учетом заливки
 * by V&S
 */
static _setpix( x, y )
{
	int i, d, s_dotpat, S_OX, S_OY;

	if( _fx_s ) {
		d = ( _y_s < y ) ? 1 : -1;
		for( i = _y_s ; i != y ; i += d )
			SETPIX( x, i );
	} else if( _fp_s ) {
		s_dotpat = _dotpat;
		S_OX = _OX;
		S_OY = _OY;
		_OX = _x_s;
		_OY = _y_s;
		_dotpat = 0177777;
		_fp_s = 0;
		_cont( x, y );
		_fp_s = 1;
		_OX = S_OX;
		_OY = S_OY;
		_dotpat = s_dotpat;
	} else
		SETPIX( x, y );
}

static _shmode(mode)
{
	mode %= 6;

	switch( mode ) {
	case 0:
		_X_pic = 052525;
		_Y_pic = 052525;
		break;
	case 1:
		_X_pic = 052525;
		_Y_pic = 0177777;
		break;
	case 2:
		_X_pic = 010421;
		_Y_pic = 010421;
		break;
	case 3:
		_X_pic = 0177777;
		_Y_pic = 052525;
		break;
	case 4:
		_X_pic = 010421;
		_Y_pic = 0177777;
		break;
	case 5:
		_X_pic = 0177777;
		_Y_pic = 010421;
		break;
	}
}

static _shadex(mode, y)
{
	int x = _OX;

	_fx_s = 1;
	_convert( &x, &y );
	_x_s = x;
	_y_s = y;
	_shmode( mode );
}

static _shadep( mode, x, y)
{
	_fp_s = 1;
	_x_s = x;
	_y_s = y;
	_shmode( mode );
}

static _noshade()
{
	_fx_s = 0;
	_fp_s = 0;
	_X_pic = 0177777;
	_Y_pic = 0177777;
}

/*
 * Установка размещения области рисования на HP LaserJet
 * by @VG & V&S
 */

h_space(x0,y0,x1,y1)
{
# ifdef PLTHP
	boty = 100.;
# else
	boty = 0.;
# endif
	obotx = x0;
	oboty = y0;
# ifndef PLOT_KIAE
	scalex = ((float)NYS)/(x1-x0);
	scaley = ((float)NXS)/(y1-y0);
# else
	scaley = scalex = ((float)NYS)/(x1-x0);
	if( (y1-y0)*scalex*FACTOR > ((float)NXS) )
		scaley = scalex = ((float)NXS)/(((float)(y1-y0))*FACTOR);
# endif
	scaley = scalex = scalex*0.95;
	botx = 0.;     /* Moves graph area to left ... */
# ifdef VECTORFONT
	_SX = (x1-x0)/70;
	_SY = (x1-x0)/50;
# endif
}

h_rectan( x1, y1, x2, y2, mode )

int     x1, y1, x2, y2, mode;
{
	_shadex( mode-1, y1);

	h_move( x1, y2 );
	h_cont( x2, y2 );

	_noshade();
}

h_grline( x, y, r, f )
float f;
{
	double sin(), cos();

	h_move( x, y );
	h_cont( x+(int)(r*cos(f)), y+(int)(r*sin(f)) );
}

h_grarc( x, y, r, f1, f2 )
int x, y, r;
float f1, f2;
{
	int nh, i;
	float h;
	double sin(), cos();

	nh = (int)(((f1>f2)?(f1-f2):(f2-f1))/(Pi/72.))+1;
	h = (f2-f1)/nh;

	h_move( x+(int)(r*cos(f1)), y+(int)(r*sin(f1)) );
	for( i = 0 ; i <= nh ; i++ )
		h_cont( x+(int)(r*cos(f1+i*h)), y+(int)(r*sin(f1+i*h)) );
}

h_sector( x0,y0,ir,fi1,fi2,mode )
int     x0,y0,ir,mode;
float   fi1, fi2;
{
	_shadep( mode , x0, y0 );
	h_grarc( x0, y0, ir, fi1, fi2 );
	_noshade();
}


/*
 * Рисование дуги - HP LaserJet
 * by @VG & V&S
 */
h_arc(cx, cy, x0, y0, x1, y1)
{
	register x, y;
	int D, d1, d2, d3, dd1, dd2, dd3;
	extern int _lptr, _dotpat;
	int snt, dx, dy;

	_convert(&cx, &cy);
	_convert(&x0, &y0);
	_convert(&x1, &y1);

	if( ! _circflag && x0-x1 <= 2 && x0-x1 >= -2 && y0-y1 <= 2 && y0-y1 >= -2 ) {
		_setpix( x0, y0 );
		_setpix( (x0+x1)/2, (y0+y1)/2 );
		_setpix( x1, y1 );
		return;
	}
	_circflag = 0;

	x = x0; y = y0;

	for( D = 0, snt = 0;; ) {
		if( (_dotpat & (1<<_lptr)) && x >= 0 && x < NXS &&
					      y >= 0 && y < NYS )
			_setpix(x, y);
		_lptr++; _lptr &= 017;

		d1 = x-x1; if( d1 < 0 ) d1 = -d1;
		d2 = y-y1; if( d2 < 0 ) d2 = -d2;
		if( d1+d2 <= 1 && snt > 2 ) break;
		if( snt++ > 2000 ) break;

		dx = (y < cy)?  1 : -1;
		dy = (x < cx)? -1 :  1;
		d1 = dd1 = D + 1 + 2*dx*(x-cx);
		d2 = dd2 = D + 1 + 2*dy*(y-cy);
		d3 = dd3 = d1+d2-D;
		if( dd1 < 0 ) dd1 = -dd1;
		if( dd2 < 0 ) dd2 = -dd2;
		if( dd3 < 0 ) dd3 = -dd3;
		if( dd1 < dd2 ) {
			if( dd3 < dd1 ) { x += dx; y += dy; D = d3; }
			else            { x += dx;          D = d1; }
		} else {
			if( dd3 < dd2 ) { x += dx; y += dy; D = d3; }
			else            {          y += dy; D = d2; }
		}
	}
	SETPIX(x1, y1);
}

/*
 * Рисование окружности - HP LaserJet
 * by @VG & V&S
 */

h_circle(x, y, r)
{
	_circflag = 1;
	h_arc(x,y,x+r,y,x+r,y);
}

h_closepl()
{
	register int i, maxi;
	int l;

	/*
	 * Вывод битовой карты в режиме 150 DPI
	 */

	if( ! density )
		fprintf( OutHard, "\033*t150R" );
	else
		fprintf( OutHard, "\033*t300R" );
	fprintf( OutHard, "\033*p250X" );
	fprintf( OutHard, "\033*r1A" );

	for( l = 0 ; l < NXS ; l++ ) {
		for( maxi = NFL-1; maxi > 0; maxi-- )
			if( _Field[maxi][l] ) break;
		maxi++;

		fprintf( OutHard, "\033*b%dW", maxi );

		for( i = 0; i < maxi ; i++ ) {
			putc( (i<NFL)? _Field[i][l] : 0, OutHard );
		}
	}
	fprintf( OutHard, "\033*rB");
	fflush( OutHard );
}

h_color(col)
{
	/* _Color = col; */
}

/*
 * Очистка экрана - Epson-80
 * by @VG & V&S
 */

h_erase()
{
	register int p, q;
	static int first;

	if( first ) {
		h_closepl();
		putc( '\014', OutHard );
		fflush( OutHard );
	}
	first = 1;

	for( p = 0 ; p < NFL ; p++ )
		for( q = 0 ; q < NXS ; q++ )
			_Field[p][q] = 0;
}

# ifndef VECTORFONT
static char *fontindex (c)
{
	register char *p;

	if (c>=040 && c<0200)
		return (& Font [(c-040) * 9]);
# ifdef __MSDOS__
	if (c >= 0200 && c <= 0257)
		c = local1 [c - 0200];
	else if (c >= 0340 && c <= 0357)
		c = local2 [c - 0340];
# else
	if (c > 0277)
		c = c;
# endif
	else
		return (0);
	return (& Font [(c-0300+0200-040) * 9]);
}

/*
 * Рисование текста - HP LaserJet
 * by @VG & V&S
 */

h_label(s)
register char *s;
{
	int c, ny;
	extern int _OX, _OY;
	int x = _OX, y = _OY;
	register char *p;
	register ix, iy;
	static COX = -1, COY = -1;
	static six, siy;

	if( COX != _OX || COY != _OY ) {
		_convert( &x, &y );
		COX = _OX; COY = _OY;
		x -= 3; y += 4;         /* centering letter's boxes */
		six = x; siy = y;
		if( siy < 9 ) siy = 9;
		if( siy >= NYS ) siy = NYS-1;
		if( six < 0 ) six = 0;
	}
	while( c = *s++ ) {
		c &= 0377;
		if (! (p = fontindex (c)))
			continue;
		if( six >= NXS-7 ) break;
		for(ny = 0 ; ny < 9 ; ny++) {
			iy = siy - ny;
			c = *p++;
			for( ix = 0 ; ix < 7 ; ix++ ) {
				if(c & 01)
					SETPIX(ix+six, iy);
				c >>= 1;
			}
		}
		six += 8;
	}
}

# else /* VECTORFONT */

static _vect(s,dx,dy,x,y)
char *s;         /* Строка */
int  dx,dy, x, y;         /* Размеры символа и нач. координаты */
{
	register char *font;
	register int xx,yy,x1,y1;
	int xyindex;
	int pen;        /* 1 - DOWN, 0 - UP, >1 - rest */
	while(*s) {
		font=VF(*s);
		s++;
		if(!font) goto next;
		pen=0;
		for(;*font;font++)
		{
			if(*font==' ') {
				pen=0;
				continue;
			}
			xyindex = IndexC(*font);
			y1=YP(xyindex,dy) + y;
			x1=XP(xyindex,dx) + x;
			if( pen )
				h_cont(x1,y1);
			else
				h_move(x1,y1);
			pen = 1;
		}
next:
		x += (long)dx;
	}
	h_move(x,y);
}

h_label(s)
register char *s;
{
	_vect(s,_SX,_SY,_OX-_SX/2,_OY-_SY/2);
}

# endif /* VECTORFONT */

/*
 * Рисование линии - HP LaserJet
 * by @VG & V&S
 */

h_line(x0,y0,x1,y1)
{
	h_move(x0, y0);
	h_cont(x1, y1);
}

/*
 * Установка типа линии - HP LaserJet
 * by @VG
 */

h_linemod(s)
char *s;
{
	_lptr = 0;
	if(      !strcmp(s, "dotted") )
		_dotpat = 016347;
	else if( !strcmp(s, "dotdashed") )
		_dotpat = 0377 | (7<<11);
	else if( !strcmp(s, "shortdashed") )
		_dotpat = 017 | (017<<8);
	else if( !strcmp(s, "longdashed") )
		_dotpat = 0377;
	else /* solid */
		_dotpat = 0177777;
}

/*
 * Установка текущей позиции - HP LaserJet
 * by @VG & V&S
 */

h_move(x, y)
{
	_OX = x; _OY = y;
	_lptr = 0;
}

h_openpl()
{
	register int i;

	for( i = 0 ; i < NFL+1 ; i++ )
		if( ( _Field[i] = (char *)malloc( NXS + DOTSIZE - 1 ) ) == NULL) {
			fprintf( stderr, "Out of memory\n" );
			exit( 1 );
		}
}

/*
 * Рисование точки - HP LaserJet
 * by @VG & V&S
 */

h_point(x, y)
{
	_OX = x; _OY = y;
	_convert(&x, &y);
	SETPIX(x, y);
	_lptr = 0;
}

/*
 * Процедуры вывода линии и точки на HP LaserJet
 * by @VG & V&S
 */

static _cont(x1 ,y1)
{
	register x, y;
	int a, b, D, dx, dy, dd1, dd2, dd3;

	_convert(&_OX, &_OY);
	x = _OX; y = _OY;

	b = x1 - x;
	a = y1 - y;
	if( a < 0 ) a = -a;
	if( b > 0 ) b = -b;
	dx = (x > x1)? -1 : 1;
	dy = (y > y1)? -1 : 1;
	D = 0;
	while( x != x1 || y != y1 ) {
		if( _dotpat & (1<<_lptr) )
			_setpix(x, y);
		_lptr++; _lptr &= 017;
		dd1 = D + a;
		dd2 = D + b;
		dd3 = dd1 + b;
		if( dd1 < 0 ) dd1 = -dd1;
		if( dd2 < 0 ) dd2 = -dd2;
		if( dd3 < 0 ) dd3 = -dd3;
		if( dd1 < dd2 ) {
			if( dd3 < dd1 )
				x += dx, y += dy, D += a+b;
			else
				x += dx, D += a;
		} else {
			if( dd3 < dd2 )
				x += dx, y += dy, D += a+b;
			else
				y += dy, D += b;
		}
	}
	_setpix(x, y);
}

h_cont(x1 ,y1)
{
	int x = x1 , y = y1;

	_convert(&x, &y);
	_cont( x, y );
	_OX = x1; _OY = y1;
}

static _convert(x, y)
int *x, *y;
{
	register ix, iy;

	ix = (*x-obotx)*scalex + botx;
	iy = (*y-oboty)*scaley + boty;
	if( ix < 0 )     ix = 0;
	if( ix > NXS-1 ) ix = NXS-1;
	if( iy < 0 )     iy = 0;
	if( iy > NYS-1 ) iy = NYS-1;
	*x = ix;
	*y = iy;
}

h_mapcolor(a,b,c,d)
{
	a = a; b = b; c = c; d = d;
}

h_dot(a,b,c,d,e)
{
	a = a; b = b; c = c; d = d; e = e;
}

h_charsize( x,y )
int *x, *y;
{
# ifndef VECTORFONT
	*x = (int)(8./scalex)+1;
	*y = (int)(10./(FACTOR*scaley))+1;
# else
	*x = _SX;
	*y = _SY;
# endif
}
